identification division.
program-id. error404.

environment division.
input-output section.

data division.

working-storage section.

procedure division.
  Display 'Error'.
end program error404.
